export const mainCategories = ["CategoryA", "CategoryB", "CategoryC"]

export const logo = "/img/logo.jpg"

export const arrayOfGoods = [
    {
        id: "001",
        name: "Капуста",
        img: "/img/someGood1.jpg",
        category: "CategoryA",
        shortDescription: "Хороший овощ, особенно для супа",
        fullDescription:
            "Капуста принадлежит к числу важнейших овощных растений. Она введена в культуру, по-видимому, в доисторические времена. Археологические раскопки свидетельствуют о том, что капусту люди стали использовать со времён каменного и бронзового веков. Возделывали капусту древние египтяне, а позднее освоили технологию её выращивания древние греки и римляне, им было известно всего от 3 до 10 сортов капусты. Капуста служила для эллинов символом трезвости, её считали активным средством против опьянения. «Съешь капусту перед питьём — не опьянеешь, съешь после — разгонишь хмель», — говорили греки. Древнегреческий философ и математик Пифагор весьма ценил лечебные свойства капусты и занимался её селекцией. Южные племена славян впервые узнали о капусте от греко-римских колонистов, живших в районах Причерноморья. Со временем познакомились с этой овощной культурой и на Руси.",
        price: 45
    },
    {
        id: "002",
        name: "Горчица",
        img: "/img/someGood2.jpg",
        category: "CategoryA",
        shortDescription: "Основной ингридиент одноименного соуса",
        fullDescription:
            "Горчица выращивалась и использовалась людьми издавна и была распространена в Старом Свете повсеместно от Европы до Китая. При этом в Европе горчица была единственной доступной острой специей. Приправу из горчицы, вероятно, впервые стали приготавливать в Римской империи. Римляне смешивали неперебродивший виноградный сок (муст) с размолотыми зёрнами белой горчицы и получали острую приправу. Рецепт приправы из горчицы имеется в кулинарной книге De re coquinaria, составленной в IV или V веке. В рецепт входят размолотые зёрна горчицы, перец, тмин, любисток, испечённые на огне семена кориандра, укроп, сельдерей, тимьян, душица (орегано), лук, мёд, уксус, гарум и растительное масло. Приправа применялась при приготовлении жареного на вертеле кабана.",
        price: 20
    },
    {
        id: "003",
        name: "Пастушья сумка",
        img: "/img/someGood3.jpg",
        category: "CategoryA",
        shortDescription: "Много в такую не сложишь",
        fullDescription:
            "В Башкирии пастушья сумка — одно из самых распространённых растений. Она встречается во всех районах республики, но на Южном Урале (в горно-лесных районах) в несколько меньших количествах, чем в Предуралье и Зауралье. Растёт она как сорное в посевах зерновых, технических культур,на огородах, в садах. Особенно большие заросли пастушья сумка образует вдоль дорог, на пустырях, на залежах в Предуралье.",
        price: 10
    },
    {
        id: "004",
        name: "Левкой",
        img: "/img/someGood4.jpg",
        category: "CategoryB",
        shortDescription: "Небольшие, но красивые цветочки",
        fullDescription:
            "Растение высотой до метра с войлочным опушением, образующее одревесневающие кустики. Стебли прямые или немного изогнутые, слабо ветвистые, с густой листвой.",
        price: 60
    },
    {
        id: "005",
        name: "Клубника",
        img: "/img/someGood5.jpg",
        category: "CategoryB",
        shortDescription: "Просто добавьте взбитых сливок",
        fullDescription:
            "С ботанической точки зрения клубника не является ягодой. Технически, это совокупный вспомогательный плод, что означает, что мясистая часть происходит не из завязей растения, а из сосуда, в котором находятся завязи. Каждое видимое семя (семянка) на внешней стороне плода на самом деле является одной из завязей цветка с семенем внутри него.",
        price: 150
    },
    {
        id: "006",
        name: "Шиповник",
        img: "/img/someGood6.jpg",
        category: "CategoryB",
        shortDescription: "Самое то в чаек",
        fullDescription:
            "Шиповники — листопадные кустарники и кустарнички, иногда вечнозелёные, с прямостоящими, лазающими или стелющимися стеблями различной высоты или длины, от 15—25 см до 8—10 м. Высота одних и тех же видов иногда может изменяться в зависимости от условий произрастания.",
        price: 100
    },
    {
        id: "007",
        name: "Спирея",
        img: "/img/someGood7.jpg",
        category: "CategoryC",
        shortDescription: "Верный друг садоводов-декораторов",
        fullDescription:
            "Ветви прямостоящие, раскинутые, лежачие, поднимающиеся или стелющиеся, от светло- до тёмно-бурых, с продольно отслаивающейся корой. Молодые побеги светло-зелёные, желтоватые, красноватые или коричневые, голые или опушённые.",
        price: 56
    },
    {
        id: "008",
        name: "Фасоль",
        img: "/img/someGood8.jpg",
        category: "CategoryC",
        shortDescription: "Оказывается, бывает не только в консервах",
        fullDescription:
            "Из культивируемых видов первое место занимает фасоль обыкновенная (Phaseolus vulgaris) со многими разновидностями и сортами, из которых одни — вьющиеся, другие — кустовые. Родина этого вида — Латинская Америка.",
        price: 65
    },
    {
        id: "009",
        name: "Люпин",
        img: "/img/someGood9.jpg",
        category: "CategoryC",
        shortDescription: "Наверняка связана с волками",
        fullDescription:
            "В Средиземноморье и Африке описано 12 видов люпина, среди которых 11 однолетних и 1 многолетний, но, видимо, уже вымерший вид. Люпины данного региона произрастают в основном очагами на лёгких почвах преимущественно на небольших высотах или морских побережьях.",
        price: 70
    }
]

export const basket = [
    {
        goodId: "001",
        goodQuantity: 3,
        chosen: false
    },
    {
        goodId: "002",
        goodQuantity: 1,
        chosen: false
    },
    {
        goodId: "008",
        goodQuantity: 5,
        chosen: false
    }
]

export const orders = [
    {
        goodsIds: ["001", "007", "009"],
        goodQuantity: { "001": 3, "007": 5, "009": 5 },
        payMethod: "Картой онлайн",
        delivery: "Самовывоз",
        date: Date.now() - 2 * 86400000,
        status: "Готов к выдаче",
        orderNumber: "R001"
    },
    {
        goodsIds: ["001", "005", "006"],
        goodsQuantity: { "001": 3, "005": 10, "006": 10 },
        payMethod: "СБП",
        delivery: "Самовывоз",
        date: Date.now(),
        status: "Комплектуется",
        orderNumber: "R002"
    }
]
